perf/endpoints/log.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10
    
    - name: Load Test
      duration: 60 
      arrivalRate: 10 
      rampTo: 300
       
    - name: Plain
      duration: 30
      arrivalRate: 300
    
    - name: Stress Test
      duration: 60 
      arrivalRate: 250 
      rampTo: 1000 

scenarios:
  - name: Log (/log)
    flow:
      - get:
          url: "/log"