perf/endpoints/log.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10

    # Load Test Phase: Simulate a steady load of users
    - name: Load Test
      duration: 60
      arrivalRate: 20
      rampTo: 20

    # Stress Test Phase: Simulate a high load
    - name: Stress Test
      duration: 60
      arrivalRate: 100
      rampTo: 200

scenarios:
  - name: Log (/log)
    flow:
      - get:
          url: "/log"